Revit 2024 API
AnalyzesAsType Enumeration
 This enum class is used for the BuiltInParameter STRUCTURAL_ANALYZES_AS.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum AnalyzesAsType
Visual Basic
Public Enumeration AnalyzesAsType
Visual C++
public enum class AnalyzesAsType
Members
Member name | Description
AA_Hanger
AA_Gravity
AA_Lateral
AA_SlabOneWay
AA_Mat
AA_SlabOnGrade
AA_Not_For_Analysis
AA_SlabTwoWay
AA_GravityLateral
See Also
Autodesk.Revit.DB Namespace